app/controllers/locations_controller.rb

SELECT * FROM `locations`
---
  def index
    @locations = Location.all

SELECT * FROM `locations` WHERE (`locations`.`id` = 980190962)
---
  def show
    @location = Location.find(params[:id])

SELECT * FROM `locations` WHERE (`locations`.`id` = 980190962)
---
  def edit
    @location = Location.find(params[:id])

INSERT INTO `locations` (`created_at`, `title`, `updated_at`, `description`) VALUES('2011-09-03 19:01:54', NULL, '2011-09-03 19:01:54', NULL)
---
  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save

SELECT * FROM `locations` WHERE (`locations`.`id` = 980190962)
---
  def update
    @location = Location.find(params[:id])

SELECT * FROM `locations` WHERE (`locations`.`id` = 980190962)
DELETE FROM `locations` WHERE `id` = 980190962
---
  def destroy
    @location = Location.find(params[:id])
    @location.destroy