app/controllers/passages_controller.rb

  def index
    @passages = Passage.all
---
SELECT * FROM `passages`

  def show
    @passage = Passage.find(params[:id])
---
SELECT * FROM `passages` WHERE (`passages`.`id` = 980190962)

  def edit
    @passage = Passage.find(params[:id])
---
SELECT * FROM `passages` WHERE (`passages`.`id` = 980190962)

  def create
    @passage = Passage.new(params[:passage])

    respond_to do |format|
      if @passage.save
---
INSERT INTO `passages` (`created_at`, `title`, `updated_at`, `destination_id`, `source_id`) VALUES('2011-09-03 19:01:54', NULL, '2011-09-03 19:01:54', NULL, NULL)

  def update
    @passage = Passage.find(params[:id])
---
SELECT * FROM `passages` WHERE (`passages`.`id` = 980190962)

  def destroy
    @passage = Passage.find(params[:id])
---
SELECT * FROM `passages` WHERE (`passages`.`id` = 980190962)